InformationRegisters/НастройкиОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОхраныТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеМестаОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьИнструктажиПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбучениеПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНесчастныеСлучаиНаПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьМедицинскиеОсмотры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПсихиатрическиеОсвидетельствования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСпециальнуюОценкуУсловийТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСредстваИндивидуальнойЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьУникальностьНомеровРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособКонтроляУникальностиНомеровРабочихМест</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыКонтроляУникальностиНомеровРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьУсловияТрудаРабочихМестОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОхранаТрудаФормы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Охрана труда"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьЗаполнениеРабочегоМеста(Форма, ЗаполнятьПоложенными) Экспорт
	
	Если Не ОхранаТруда.УсловияТрудаРабочихМестОхраныТрудаПрименяются(Форма.Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьПоложенными = ЗаполнятьПоложенными Или ЗначениеЗаполнено(Форма.Объект.РабочееМесто);
	
КонецПроцедуры

Процедура ПриНастройкеДинамическогоСпискаНазначенияРабочихМест(ДополненияЗапроса) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ДополненияЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОхраныТруда КАК НастройкиОхраныТруда
		|		ПО НазначениеРабочихМестПереопределяемый.Организация = НастройкиОхраныТруда.Организация
		|		И (НЕ НастройкиОхраныТруда.ИспользоватьРабочиеМестаОхраныТруда)
		|ГДЕ
		|	НастройкиОхраныТруда.ИспользоватьРабочиеМестаОхраныТруда ЕСТЬ NULL");
	
КонецПроцедуры

#Область Сотрудники

Процедура ФормаСотрудникаДобавитьЭлементыФормы(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущаяОрганизация") Тогда
		ТекущаяОрганизация = Форма.ТекущаяОрганизация;
	Иначе
		ТекущаяОрганизация = Неопределено;
	КонецЕсли;
	
	Если Не ОхранаТруда.ОхранаТрудаДоступнаПользователю(ТекущаяОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Команды.Найти("ОхранаТруда") = Неопределено Тогда
		КомандаОхранаТруда = Форма.Команды.Добавить("ОхранаТруда");
		КомандаОхранаТруда.Действие = "Подключаемый_ОхранаТруда";
		КомандаОхранаТруда.Заголовок = НСтр("ru = 'Охрана труда'");
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ОхранаТруда") = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("ОхранаТруда", Тип("КнопкаФормы"), Форма.Элементы.ГруппаОхранаТруда);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = "ОхранаТруда";
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("ДоступныТолькоДанныеСотрудника") И Форма.Параметры.ДоступныТолькоДанныеСотрудника
		И Форма.Элементы.Найти("ГруппаДополнительныеДанные") <> Неопределено Тогда
		
		СкрытьЛишниеКоманды(Форма.Элементы.ГруппаДополнительныеДанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура СотрудникиУстановитьПараметрыФормы(Форма) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаДоступнаПользователю(Форма.ТекущаяОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.АнтропометрияФизическихЛиц)
		И Не ПравоДоступа("Изменение", Метаданные.Справочники.РабочиеМестаОхраныТруда)
		И Не (Форма.ДоступенПросмотрДанныхДляНачисленияЗарплаты Или Форма.ДоступноДобавлениеИзменениеДанныхФизическихЛиц) Тогда
		
		Форма.Параметры.ДоступныТолькоДанныеСотрудника = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КадровыйУчет

Процедура ПослеЗаписиФормыКадровогоДокументаНаСервере(ДокументОбъект, СотрудникиМассив) Экспорт
	
	ФизическиеЛицаСотрудников = КадровыйУчет.ФизическиеЛицаСотрудников(СотрудникиМассив);
	МедицинскиеОсмотры.ЗапуститьОбновлениеПериодическихОсмотров(, ФизическиеЛицаСотрудников);
	ОбучениеПоОхранеТруда.ЗапуститьОбновлениеПериодическихОбученийПоОхранеТруда(, ФизическиеЛицаСотрудников);
	СредстваИндивидуальнойЗащиты.ЗапуститьОбновлениеВыдачСИЗ(, ФизическиеЛицаСотрудников);
	
КонецПроцедуры

Процедура ПереопределитьДанныеДолжностиВФорме(Форма, ДанныеДолжности, ТекущаяДолжность) Экспорт
	
	Если Не ОхранаТруда.УсловияТрудаРабочихМестОхраныТрудаПрименяются() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПеревод = Ложь;
	
	РабочееМесто = ЗначениеРабочегоМестаВФормеКадровогоПриказа(Форма, ДанныеДолжности, ЭтоПеревод);
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = "ВыплачиваетсяНадбавкаЗаВредность,ПроцентНадбавкиЗаВредность,Должность,Подразделение";
	
	ДанныеРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочееМесто, ИменаРеквизитов, Истина);
	
	Для Каждого КлючИЗначение Из ДанныеДолжности Цикл
		Если ЭтоПеревод И ЗначениеЗаполнено(ТекущаяДолжность) И ТекущаяДолжность = КлючИЗначение.Ключ Тогда
			Если ЗначениеЗаполнено(Форма.ТекущееРабочееМесто) Тогда
				ДанныеТекущегоРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.ТекущееРабочееМесто, ИменаРеквизитов);
			Иначе
				ДанныеТекущегоРабочегоМеста = Новый Структура(ИменаРеквизитов, Ложь, 0);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение, ДанныеТекущегоРабочегоМеста, , "Должность,Подразделение");
		Иначе
			Если Не (ДанныеРабочегоМеста.Подразделение = КлючИЗначение.Значение.Подразделение
				   И ДанныеРабочегоМеста.Должность = КлючИЗначение.Значение.Должность) Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение, ДанныеРабочегоМеста, , "Должность,Подразделение");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереопределитьДанныеНадбавкиЗаВредность(Форма, Организация, ДанныеДолжности, Должность, Сотрудник, ДатаСведений) Экспорт
	
	Если Не ОхранаТруда.УсловияТрудаРабочихМестОхраныТрудаПрименяются(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьРабочееМесто = Истина;
	
	РабочееМесто = ЗначениеРабочегоМестаВФормеКадровогоПриказа(Форма, ДанныеДолжности, , ИзменитьРабочееМесто);
	Если РабочееМесто = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РабочееМесто) И Не ИзменитьРабочееМесто Тогда
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "РабочееМестоОхраныТруда", ДатаСведений, , Ложь);
		Если КадровыеДанные.Количество() > 0 Тогда
			РабочееМесто = КадровыеДанные[0].РабочееМестоОхраныТруда;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ДанныеУсловийТруда = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Должность, "ВыплачиваетсяНадбавкаЗаВредность,ПроцентНадбавкиЗаВредность");
	Иначе
		ДанныеУсловийТруда = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочееМесто, "ВыплачиваетсяНадбавкаЗаВредность,ПроцентНадбавкиЗаВредность");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеДолжности, ДанныеУсловийТруда);
	
КонецПроцедуры

Процедура ДополнитьДанныеПозицииРабочимМестом(Форма, ДанныеНовойПозиции, ДанныеПрошлойПозиции = Неопределено) Экспорт
	
	Если Не ОхранаТруда.УсловияТрудаРабочихМестОхраныТрудаПрименяются(Форма.Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНовойПозиции.Вставить("РабочееМесто", Форма.Объект.РабочееМесто);
	
	Если ДанныеПрошлойПозиции <> Неопределено Тогда
		ДанныеПрошлойПозиции.Вставить("РабочееМесто", Форма.ТекущееРабочееМесто);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкрытьЛишниеКоманды(ЭлементФормы)
	
	Если ЭлементФормы.Вид = ВидКнопкиФормы.Гиперссылка И ЭлементФормы.ИмяКоманды <> "ОхранаТруда" Тогда
		ЭлементФормы.Доступность = Ложь;
	ИначеЕсли ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
		Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
			СкрытьЛишниеКоманды(Элемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеРабочегоМестаВФормеКадровогоПриказа(Форма, ДанныеДолжности, ЭтоПеревод = Ложь, ИзменитьРабочееМесто = Ложь)
	
	Если ДанныеДолжности = Неопределено Или Форма.Элементы.Найти("РабочееМесто") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПутьКРабочемуМесту = "Объект.РабочееМесто";
	ЭтоПеревод = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ИзменитьРабочееМесто");
	Если ЭтоПеревод Тогда
		ИзменитьРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.ИзменитьРабочееМесто");
		Если Не ИзменитьРабочееМесто Тогда
			ПутьКРабочемуМесту = "ТекущееРабочееМесто";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКРабочемуМесту);
	
КонецФункции

#КонецОбласти
